# Libraries

In [2]:
import pandas as pd

# Dataset Loading

In [3]:
df = pd.read_csv('./dataset/bustabit.csv')

# EDA

In [4]:
df.head()

,Id,GameID,Username,Bet,CashedOut,Bonus,Profit,BustedAt,PlayDate
0,14196549,3366002,papai,5,1.20,0.0,1.00,8.24,2016-11-20T19:44:19Z
1,10676217,3343882,znay22,3,NaN,NaN,NaN,1.40,2016-11-14T14:21:50Z
2,15577107,3374646,rrrrrrrr,4,1.33,3.0,1.44,3.15,2016-11-23T06:39:15Z
3,25732127,3429241,sanya1206,10,NaN,NaN,NaN,1.63,2016-12-08T18:13:55Z
4,17995432,3389174,ADM,50,1.50,1.4,25.70,2.29,2016-11-27T08:14:48Z

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Id         50000 non-null  int64
 1   GameID     50000 non-null  int64
 2   Username   50000 non-null  object
 3   Bet        50000 non-null  int64
 4   CashedOut  28734 non-null  float64
 5   Bonus      28734 non-null  float64
 6   Profit     28734 non-null  float64
 7   BustedAt   50000 non-null  float64
 8   PlayDate   50000 non-null  object
dtypes: float64(4), int64(3), object(2)
memory usage: 3.4+ MB

In [6]:
df.count()

Id           50000
GameID       50000
Username     50000
Bet          50000
CashedOut    28734
Bonus        28734
Profit       28734
BustedAt     50000
PlayDate     50000
dtype: int64

In [10]:
unique_username = df['Username'].unique()

In [18]:
unique_username

array(['papai', 'znay22', 'rrrrrrrr', ..., 'FDimarin', 'FokJulleNaaiers',
       'bitcoinbandit'], dtype=object)

In [14]:
print(unique_username)

['papai' 'znay22' 'rrrrrrrr' ... 'FDimarin' 'FokJulleNaaiers'
 'bitcoinbandit']

In [19]:
unique_count = df['Username'].nunique()

In [20]:
unique_count

4149

In [21]:
unique_bet = df['Bet'].nunique()

In [22]:
print(unique_bet)

2758

In [30]:
total_bets_per_player = df.groupby('Username')['Bet'].sum() \
                         .reset_index() \
                         .sort_values('Bet', ascending=False)
total_bets_per_player.columns = ['Username', 'TotalBetAmount']

# Feature Engineering

In [31]:
total_bets_per_player.head()

        Username  TotalBetAmount
2004    allg1124        16262350
133        Alexy        12216534
3743  stevemoley         6173301
4114       zabby         5503821
2667  goosin2000         4469000

In [27]:
player_stats = df.groupby('Username').agg(
    TotalBetAmount=('Bet', 'sum'),
    NumberOfBets=('Bet', 'count'),
    AverageBet=('Bet', 'mean'),
    MaxBet=('Bet', 'max')
).reset_index().sort_values('TotalBetAmount', ascending=False)

In [29]:
player_stats.head()

        Username  TotalBetAmount  NumberOfBets     AverageBet   MaxBet
2004    allg1124        16262350           101  161013.366337  1000000
133        Alexy        12216534            47  259926.255319  1000000
3743  stevemoley         6173301            25  246932.040000  1000000
4114       zabby         5503821            30  183460.700000   988571
2667  goosin2000         4469000            19  235210.526316   550000

In [23]:
total_bets_per_player = df.groupby('Username')['Bet'].sum().reset_index()

In [24]:
total_bets_per_player.columns = ['Username', 'TotalBetAmount']

In [25]:
total_bets_per_player

              Username  TotalBetAmount
0     ----------------              31
1            --dilib--            1686
2              -31337-             130
3            -Nothing-           20987
4             -Tachyon            5124
...                ...             ...
4144              zuko             500
4145               zum             203
4146          zviadits            1352
4147           zzanggu          120967
4148       zzanggubank           18958

[4149 rows x 2 columns]

In [26]:
total_bets_per_player.head()

           Username  TotalBetAmount
0  ----------------              31
1         --dilib--            1686
2           -31337-             130
3         -Nothing-           20987
4          -Tachyon            5124